# Задача 43: Дана последовательность чисел.
# Получить список уникальных элементов заданной последовательности.

# Пример:

# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

# list = [1, 2, 3, 5, 1, 5, 3, 10]
# unique_list = []
# for i in list:
#     if i > 1:
#         list.remove(i)
#     else:
#         unique_list.append(i)
# print(unique_list)